// 자료구조(DataStruct)
// 자료의 집합을 의미
// 각 원소들이 논리적으로 정의된 규칙에 의해 나열
// 나열된 자료에 대한 처리를 효율적으로 수행할 수 있도록
// 자료를 구분하여 표현한 것
// 자료를 효율적으로 저장하고 관리하며 실행시간을 단축 또는 메모리 절약

// 선형 자료구조
// 자료들이 순서대로 나열되는 구조
// 데이터 접근 방법으로는 순서접근. 직접접근이 있음
// 배열, 스택, 큐, 연결리스트, 덱

// 비선형 자료구조
// 복잡한 연결을 갖는 형태
// 트리, 그래프

// 알고리즘
// 알고리즘은 저장된 데이터를 이용하여 문제를 해결하기 위한
// 절차나 방법을 의미
// 좋은 알고리즘을 만들기 위해서는 5가지 조건이 있다
// 입력 : 0개 이상의 입력이 존재 해야 한다.
// 출력 : 1개 이상의 출력이 존재 해야 한다.
// 명확성 : 각 명령어의 의미는 모호하지 않고 명확해야 한다.
// 유한성 : 한정된 수의 단계 후에는 반드시 종료해야 한다.
// 유효성 : 각 명령어들은 실행 가능한 연산이어야 한다.

// 알고리즘 표현 방법
// 자연어 : 인간이 이해하기 쉬운 말로 되어 있는 형태
//          단어들이 명확하지 않으면 의미전달이 모호해진다.
// 순서도(FlowChart) : 직관적이며 이해하기 쉽다.
//                  복잡한 알고리즘은 작성이 복잡해진다.
// 의사코드 : 프로그래밍언어는 아닌데 프로그래밍 코드를 흉내내어 표현하는 코드
//          알고리즘 핵심 내용에만 집중
// 프로그래밍 언어 : 표현하고자 하는대로 정확하게 알고리즘 기술

